app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Inverno 2018"], ["description", "Inverno 2018 é uma categoria..."], ["created_at", "2018-09-30 23:04:55.097686"], ["updated_at", "2018-09-30 23:04:55.097686"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save