app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["category_id", 1], ["created_at", "2018-09-30 23:05:31.951948"], ["updated_at", "2018-09-30 23:05:31.951948"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save